---
type: ElementLevelFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# ElementLevelFilter

`Autodesk.Revit.DB.ElementLevelFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ElementLevelFilter | — | `` |
| Method | PassesFilter | — | `` |
| Property | LevelId | 2011 | `public ElementId LevelId { get ; }` |